# Example: JupySQL + SQLite

## ðŸ““ System preparation for running in Jupyter Notebook:
`JupySQL` allows you to run SQL commands and create charts from large datasets in Jupyter using the %sql, %%sql, and %sqlplot magics. JupySQL is compatible with all major databases (e.g., PostgreSQL, MySQL, SQL Server), data warehouses (like Snowflake, BigQuery, Redshift), and embedded engines (SQLite and DuckDB).

## required

In [ ]:
pip install ipykernel jupyterlab jupysql --upgrade --no-cache-dir

## Load `JupySQL` & Connect to SQLite

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///mydatabase.db

%config SqlMagic.displaylimit = 0

## Some sample code

In [ ]:
%%sql

-- Create the employees table
DROP TABLE IF EXISTS employees;
CREATE TABLE employees (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    position TEXT NOT NULL,
    salary REAL NOT NULL,
    hire_date DATE NOT NULL,
    department TEXT NOT NULL,
    email TEXT NOT NULL UNIQUE,
    phone TEXT NOT NULL,
    address TEXT NOT NULL
);

In [ ]:
%%sql
-- view the empty employees table
SELECT * FROM employees;

In [ ]:
%%sql

-- Insert some sample data into the employees table
INSERT INTO employees (name, position, salary, hire_date, department, email, phone, address) VALUES
('Alice Johnson', 'Software Engineer', 90000.00, '2020-01-15', 'Engineering', 'alice.johnson@example.com', '555-1234', '123 Elm St'),
('Bob Smith', 'Data Analyst', 75000.00, '2019-03-22', 'Data Science', 'bob.smith@example.com', '555-5678', '456 Oak St'),
('Charlie Brown', 'Project Manager', 85000.00, '2018-07-30', 'Management', 'charlie.brown@example.com', '555-8765', '789 Pine St'),
('Diana Prince', 'UX Designer', 80000.00, '2021-05-10', 'Design', 'diana.prince@example.com', '555-4321', '321 Maple St'),
('Ethan Hunt', 'DevOps Engineer', 95000.00, '2017-11-05', 'Operations', 'ethan.hunt@example.com', '555-9876', '654 Cedar St'),
('Fiona Gallagher', 'HR Specialist', 70000.00, '2019-09-18', 'Human Resources', 'fiona.gallagher@example.com', '555-6543', '987 Birch St'),
('George Martin', 'Marketing Manager', 82000.00, '2020-02-25', 'Marketing', 'george.martin@example.com', '555-3210', '159 Spruce St'),
('Hannah Lee', 'Sales Representative', 68000.00, '2018-12-12', 'Sales', 'hannah.lee@example.com', '555-7890', '753 Willow St'),
('Ian Wright', 'Financial Analyst', 78000.00, '2019-06-17', 'Finance', 'ian.wright@example.com', '555-2345', '852 Cherry St'),
('Jane Doe', 'Customer Support', 65000.00, '2021-08-01', 'Support', 'jane.doe@example.com', '555-3456', '951 Walnut St');

In [ ]:
%%sql

-- view the employees table with the inserted data
SELECT * FROM employees;